k6-rigorous-stress-rerun-output.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/k6/rigorous-stress-test.js
        output: json (test-results-rigorous-stress-rerun.json)

     scenarios: (100.00%) 10 scenarios, 10 max VUs, 2m31.8s max duration (incl. graceful stop):
              * wave1_male1: 1 iterations shared among 1 VUs (maxDuration: 2m0s, gracefulStop: 30s)
              * wave1_male2: 1 iterations shared among 1 VUs (maxDuration: 2m0s, startTime: 200ms, gracefulStop: 30s)
              * wave1_male3: 1 iterations shared among 1 VUs (maxDuration: 2m0s, startTime: 400ms, gracefulStop: 30s)
              * wave1_male4: 1 iterations shared among 1 VUs (maxDuration: 2m0s, startTime: 600ms, gracefulStop: 30s)
              * wave1_male5: 1 iterations shared among 1 VUs (maxDuration: 2m0s, startTime: 800ms, gracefulStop: 30s)
              * wave2_female1: 1 iterations shared among 1 VUs (maxDuration: 2m0s, startTime: 1s, gracefulStop: 30s)
              * wave2_female2: 1 iterations shared among 1 VUs (maxDuration: 2m0s, startTime: 1.2s, gracefulStop: 30s)
              * wave2_female3: 1 iterations shared among 1 VUs (maxDuration: 2m0s, startTime: 1.4s, gracefulStop: 30s)
              * wave2_female4: 1 iterations shared among 1 VUs (maxDuration: 2m0s, startTime: 1.6s, gracefulStop: 30s)
              * wave2_female5: 1 iterations shared among 1 VUs (maxDuration: 2m0s, startTime: 1.8s, gracefulStop: 30s)

time="2025-12-08T23:42:40Z" level=info msg="[1-m3] Starting stress test - male user: d25a6f6b-3d3e-467b-a8cd-07ff4d2e8b3d (heartbeat: 3s, disconnect: true)" source=console
time="2025-12-08T23:42:40Z" level=info msg="[1-m2] Starting stress test - male user: 60806738-fa66-49e8-9370-fead73643208 (heartbeat: 5s, disconnect: false)" source=console
time="2025-12-08T23:42:40Z" level=info msg="[1-m1] Starting stress test - male user: 1823ed11-b1e0-42f9-9281-7bad436def6e (heartbeat: 5s, disconnect: false)" source=console
time="2025-12-08T23:42:41Z" level=info msg="[2-f1] Starting stress test - female user: b9c0e4cc-c770-4991-bb0c-7e3ee808e31c (heartbeat: 3s, disconnect: false)" source=console
time="2025-12-08T23:42:41Z" level=info msg="[1-m4] Starting stress test - male user: 0404dd04-08c4-45b2-a573-9279aff9b343 (heartbeat: 5s, disconnect: false)" source=console

running (0m01.0s), 05/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs    0m01.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs    0m00.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs    0m00.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs    0m00.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs    0m00.2s/2m0s  0/1 shared iters
wave2_female1 • [   0% ] waiting  0.0s         
wave2_female2 • [   0% ] waiting  0.2s         
wave2_female3 • [   0% ] waiting  0.4s         
wave2_female4 • [   0% ] waiting  0.6s         
wave2_female5 • [   0% ] waiting  0.8s         
time="2025-12-08T23:42:41Z" level=info msg="[1-m5] Starting stress test - male user: 89d38952-e44e-4946-9034-76ea7dd57da1 (heartbeat: 5s, disconnect: false)" source=console
time="2025-12-08T23:42:41Z" level=info msg="[2-f4] Starting stress test - female user: 0b3c5725-87a6-4df1-a6eb-380ac926a470 (heartbeat: 3s, disconnect: false)" source=console
time="2025-12-08T23:42:41Z" level=info msg="[2-f3] Starting stress test - female user: 3df39b4b-7aa0-4af5-9756-dcb38414df6d (heartbeat: 5s, disconnect: true)" source=console
time="2025-12-08T23:42:42Z" level=info msg="[2-f2] Starting stress test - female user: a024f0bf-c7f7-4e67-a364-1a63e9f6d68d (heartbeat: 5s, disconnect: false)" source=console
time="2025-12-08T23:42:42Z" level=info msg="[2-f5] Starting stress test - female user: 5ac2dab1-54bd-4bcd-87b6-a201b3299e2e (heartbeat: 5s, disconnect: false)" source=console

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m02.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m01.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m01.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m01.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m01.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m01.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m00.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m00.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m00.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m00.2s/2m0s  0/1 shared iters

running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m03.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m02.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m02.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m02.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m02.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m02.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m01.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m01.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m01.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m01.2s/2m0s  0/1 shared iters

running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m04.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m03.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m03.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m03.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m03.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m03.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m02.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m02.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m02.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m02.2s/2m0s  0/1 shared iters

running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m05.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m04.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m04.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m04.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m04.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m04.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m03.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m03.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m03.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m03.2s/2m0s  0/1 shared iters

running (0m06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m06.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m05.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m05.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m05.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m05.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m05.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m04.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m04.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m04.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m04.2s/2m0s  0/1 shared iters
time="2025-12-08T23:42:46Z" level=info msg="[1-m1] ✅ Joined queue (6029ms)" source=console
time="2025-12-08T23:42:46Z" level=info msg="[1-m1] Starting to poll for match with heartbeat (interval: 5s)..." source=console
time="2025-12-08T23:42:46Z" level=info msg="[1-m2] ✅ Joined queue (6270ms)" source=console
time="2025-12-08T23:42:46Z" level=info msg="[1-m2] Starting to poll for match with heartbeat (interval: 5s)..." source=console
time="2025-12-08T23:42:46Z" level=info msg="[1-m4] ✅ Joined queue (5716ms)" source=console
time="2025-12-08T23:42:46Z" level=info msg="[1-m4] Starting to poll for match with heartbeat (interval: 5s)..." source=console
time="2025-12-08T23:42:47Z" level=info msg="[1-m5] ✅ Joined queue (5565ms)" source=console
time="2025-12-08T23:42:47Z" level=info msg="[1-m5] Starting to poll for match with heartbeat (interval: 5s)..." source=console
time="2025-12-08T23:42:47Z" level=info msg="[2-f1] ✅ Joined queue (6098ms)" source=console
time="2025-12-08T23:42:47Z" level=info msg="[2-f1] Starting to poll for match with heartbeat (interval: 3s)..." source=console
time="2025-12-08T23:42:47Z" level=info msg="[2-f2] ✅ Joined queue (5111ms)" source=console
time="2025-12-08T23:42:47Z" level=info msg="[2-f2] Starting to poll for match with heartbeat (interval: 5s)..." source=console
time="2025-12-08T23:42:47Z" level=info msg="[2-f4] ✅ Joined queue (5518ms)" source=console
time="2025-12-08T23:42:47Z" level=info msg="[2-f4] Starting to poll for match with heartbeat (interval: 3s)..." source=console
time="2025-12-08T23:42:47Z" level=info msg="[2-f3] ✅ Joined queue (5339ms)" source=console
time="2025-12-08T23:42:47Z" level=info msg="[2-f3] Starting to poll for match with heartbeat (interval: 5s)..." source=console
time="2025-12-08T23:42:47Z" level=info msg="[1-m3] ✅ Joined queue (6760ms)" source=console
time="2025-12-08T23:42:47Z" level=info msg="[1-m3] Starting to poll for match with heartbeat (interval: 3s)..." source=console
time="2025-12-08T23:42:47Z" level=info msg="[2-f5] ✅ Joined queue (5014ms)" source=console
time="2025-12-08T23:42:47Z" level=info msg="[2-f5] Starting to poll for match with heartbeat (interval: 5s)..." source=console

running (0m07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m07.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m06.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m06.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m06.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m06.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m06.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m05.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m05.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m05.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m05.2s/2m0s  0/1 shared iters

running (0m08.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m08.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m07.7s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m07.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m07.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m07.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m07.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m06.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m06.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m06.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m06.2s/2m0s  0/1 shared iters

running (0m09.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m09.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m08.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m08.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m08.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m08.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m08.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m07.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m07.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m07.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m07.2s/2m0s  0/1 shared iters

running (0m10.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m10.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m09.7s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m09.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m09.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m09.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m09.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m08.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m08.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m08.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m08.2s/2m0s  0/1 shared iters

running (0m11.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m11.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m10.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m10.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m10.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m10.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m10.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m09.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m09.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m09.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m09.2s/2m0s  0/1 shared iters

running (0m12.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m12.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m11.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m11.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m11.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m11.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m11.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m10.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m10.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m10.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m10.2s/2m0s  0/1 shared iters

running (0m13.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m13.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m12.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m12.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m12.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m12.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m12.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m11.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m11.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m11.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m11.2s/2m0s  0/1 shared iters

running (0m14.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m14.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m13.7s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m13.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m13.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m13.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m13.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m12.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m12.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m12.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m12.2s/2m0s  0/1 shared iters

running (0m15.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m15.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m14.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m14.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m14.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m14.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m14.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m13.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m13.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m13.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m13.2s/2m0s  0/1 shared iters

running (0m16.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m16.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m15.7s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m15.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m15.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m15.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m15.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m14.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m14.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m14.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m14.2s/2m0s  0/1 shared iters

running (0m17.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m17.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m16.7s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m16.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m16.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m16.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m16.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m15.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m15.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m15.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m15.2s/2m0s  0/1 shared iters

running (0m18.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m18.0s/2m0s  0/1 shared iters
wave1_male2     [   0% ] 1 VUs  0m17.8s/2m0s  0/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m17.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m17.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m17.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m17.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m16.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m16.6s/2m0s  0/1 shared iters
wave2_female4   [   0% ] 1 VUs  0m16.4s/2m0s  0/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m16.2s/2m0s  0/1 shared iters
time="2025-12-08T23:42:58Z" level=info msg="[1-m2] State change: null → paired (1s)" source=console
time="2025-12-08T23:42:58Z" level=info msg="[1-m2] ✅ MATCH FOUND after 1s (11697ms)" source=console
time="2025-12-08T23:42:58Z" level=info msg="[1-m2] Match ID: a0d0fe56-abbe-4134-a427-4bee7fe60c54" source=console
time="2025-12-08T23:42:58Z" level=info msg="[1-m2] Partner: Test User 3df39b4b" source=console
time="2025-12-08T23:42:58Z" level=info msg="[1-m2] State: paired" source=console
time="2025-12-08T23:42:58Z" level=info msg="[1-m2] Heartbeats sent: 1" source=console
time="2025-12-08T23:42:58Z" level=info msg="[1-m2] ✅ Vote window initialized (expires: 2025-12-08T23:43:06.256396+00:00)" source=console
time="2025-12-08T23:42:58Z" level=info msg="[1-m2] Test completed. Match found: true, Heartbeats: 1" source=console
time="2025-12-08T23:42:58Z" level=info msg="[1-m2] State changes: [{\"time\":1,\"timeMs\":11695,\"from\":null,\"to\":\"paired\"}]" source=console
time="2025-12-08T23:42:59Z" level=info msg="[2-f2] State change: null → paired (1s)" source=console
time="2025-12-08T23:42:59Z" level=info msg="[2-f2] ✅ MATCH FOUND after 1s (11817ms)" source=console
time="2025-12-08T23:42:59Z" level=info msg="[2-f2] Match ID: 1cf702a5-25dd-4139-8b48-3672a1a306fe" source=console
time="2025-12-08T23:42:59Z" level=info msg="[2-f2] Partner: Test User 1823ed11" source=console
time="2025-12-08T23:42:59Z" level=info msg="[2-f2] State: paired" source=console
time="2025-12-08T23:42:59Z" level=info msg="[2-f2] Heartbeats sent: 1" source=console
time="2025-12-08T23:42:59Z" level=info msg="[2-f2] ✅ Vote window initialized (expires: 2025-12-08T23:43:06.256396+00:00)" source=console
time="2025-12-08T23:42:59Z" level=info msg="[2-f2] Test completed. Match found: true, Heartbeats: 1" source=console
time="2025-12-08T23:42:59Z" level=info msg="[2-f2] State changes: [{\"time\":1,\"timeMs\":11817,\"from\":null,\"to\":\"paired\"}]" source=console

running (0m19.0s), 08/10 VUs, 2 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m19.0s/2m0s  0/1 shared iters
wave1_male2   ✓ [ 100% ] 1 VUs  0m18.0s/2m0s  1/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m18.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m18.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m18.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m18.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m17.8s/2m0s  0/1 shared iters
wave2_female3   [   0% ] 1 VUs  0m17.6s/2m0s  0/1 shared iters
wave2_female4 ✓ [ 100% ] 1 VUs  0m16.9s/2m0s  1/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m17.2s/2m0s  0/1 shared iters
time="2025-12-08T23:43:00Z" level=info msg="[2-f3] State change: null → paired (1s)" source=console
time="2025-12-08T23:43:00Z" level=info msg="[2-f3] ✅ MATCH FOUND after 1s (13004ms)" source=console
time="2025-12-08T23:43:00Z" level=info msg="[2-f3] Match ID: a0d0fe56-abbe-4134-a427-4bee7fe60c54" source=console
time="2025-12-08T23:43:00Z" level=info msg="[2-f3] Partner: Test User 60806738" source=console
time="2025-12-08T23:43:00Z" level=info msg="[2-f3] State: paired" source=console
time="2025-12-08T23:43:00Z" level=info msg="[2-f3] Heartbeats sent: 1" source=console
time="2025-12-08T23:43:00Z" level=info msg="[2-f3] ✅ Vote window initialized (expires: 2025-12-08T23:43:06.256396+00:00)" source=console
time="2025-12-08T23:43:00Z" level=info msg="[2-f3] Test completed. Match found: true, Heartbeats: 1" source=console
time="2025-12-08T23:43:00Z" level=info msg="[2-f3] State changes: [{\"time\":1,\"timeMs\":13003,\"from\":null,\"to\":\"paired\"}]" source=console
time="2025-12-08T23:43:00Z" level=info msg="[2-f1] State change: null → waiting (1s)" source=console
time="2025-12-08T23:43:00Z" level=info msg="[2-f1] Still waiting... (1s, state: waiting, heartbeats: 1)" source=console
time="2025-12-08T23:43:00Z" level=info msg="[1-m4] State change: null → waiting (1s)" source=console
time="2025-12-08T23:43:00Z" level=info msg="[1-m4] Still waiting... (1s, state: waiting, heartbeats: 1)" source=console

running (0m20.0s), 07/10 VUs, 3 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m20.0s/2m0s  0/1 shared iters
wave1_male2   ✓ [ 100% ] 1 VUs  0m18.0s/2m0s  1/1 shared iters
wave1_male3     [   0% ] 1 VUs  0m19.6s/2m0s  0/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m19.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m19.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m19.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m18.8s/2m0s  0/1 shared iters
wave2_female3 ✓ [ 100% ] 1 VUs  0m18.3s/2m0s  1/1 shared iters
wave2_female4 ✓ [ 100% ] 1 VUs  0m16.9s/2m0s  1/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m18.2s/2m0s  0/1 shared iters
time="2025-12-08T23:43:01Z" level=warning msg="[2-f4] ⚠️ Heartbeat failed at poll 0" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m5] State change: null → waiting (1s)" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m5] Still waiting... (1s, state: waiting, heartbeats: 1)" source=console
time="2025-12-08T23:43:01Z" level=warning msg="[1-m3] ⚠️ Heartbeat failed at poll 0" source=console
time="2025-12-08T23:43:01Z" level=warning msg="[2-f5] ⚠️ Heartbeat failed at poll 0" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m1] State change: null → paired (1s)" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m1] ✅ MATCH FOUND after 1s (14491ms)" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m1] Match ID: 1cf702a5-25dd-4139-8b48-3672a1a306fe" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m1] Partner: Test User a024f0bf" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m1] State: paired" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m1] Heartbeats sent: 1" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m1] ✅ Vote window initialized (expires: 2025-12-08T23:43:06.256396+00:00)" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m1] Test completed. Match found: true, Heartbeats: 1" source=console
time="2025-12-08T23:43:01Z" level=info msg="[1-m1] State changes: [{\"time\":1,\"timeMs\":14491,\"from\":null,\"to\":\"paired\"}]" source=console

running (0m21.0s), 06/10 VUs, 4 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m21.0s/2m0s  0/1 shared iters
wave1_male2   ✓ [ 100% ] 1 VUs  0m18.0s/2m0s  1/1 shared iters
wave1_male3   ✓ [ 100% ] 1 VUs  0m20.5s/2m0s  1/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m20.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m20.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m20.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m19.8s/2m0s  0/1 shared iters
wave2_female3 ✓ [ 100% ] 1 VUs  0m18.3s/2m0s  1/1 shared iters
wave2_female4 ✓ [ 100% ] 1 VUs  0m16.9s/2m0s  1/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m19.2s/2m0s  0/1 shared iters
time="2025-12-08T23:43:02Z" level=info msg="[2-f4] State change: null → waiting (1s)" source=console
time="2025-12-08T23:43:02Z" level=info msg="[2-f4] Still waiting... (1s, state: waiting, heartbeats: 0)" source=console
time="2025-12-08T23:43:02Z" level=info msg="[1-m3] State change: null → waiting (1s)" source=console
time="2025-12-08T23:43:02Z" level=info msg="[1-m3] Still waiting... (1s, state: waiting, heartbeats: 0)" source=console
time="2025-12-08T23:43:02Z" level=info msg="[2-f5] State change: null → waiting (1s)" source=console
time="2025-12-08T23:43:02Z" level=info msg="[2-f5] Still waiting... (1s, state: waiting, heartbeats: 0)" source=console

running (0m22.0s), 06/10 VUs, 4 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m22.0s/2m0s  0/1 shared iters
wave1_male2   ✓ [ 100% ] 1 VUs  0m18.0s/2m0s  1/1 shared iters
wave1_male3   ✓ [ 100% ] 1 VUs  0m20.5s/2m0s  1/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m21.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m21.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m21.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m20.8s/2m0s  0/1 shared iters
wave2_female3 ✓ [ 100% ] 1 VUs  0m18.3s/2m0s  1/1 shared iters
wave2_female4 ✓ [ 100% ] 1 VUs  0m16.9s/2m0s  1/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m20.2s/2m0s  0/1 shared iters

running (0m23.0s), 06/10 VUs, 4 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m23.0s/2m0s  0/1 shared iters
wave1_male2   ✓ [ 100% ] 1 VUs  0m18.0s/2m0s  1/1 shared iters
wave1_male3   ✓ [ 100% ] 1 VUs  0m20.5s/2m0s  1/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m22.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m22.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m22.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m21.8s/2m0s  0/1 shared iters
wave2_female3 ✓ [ 100% ] 1 VUs  0m18.3s/2m0s  1/1 shared iters
wave2_female4 ✓ [ 100% ] 1 VUs  0m16.9s/2m0s  1/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m21.2s/2m0s  0/1 shared iters

running (0m24.0s), 06/10 VUs, 4 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m24.0s/2m0s  0/1 shared iters
wave1_male2   ✓ [ 100% ] 1 VUs  0m18.0s/2m0s  1/1 shared iters
wave1_male3   ✓ [ 100% ] 1 VUs  0m20.5s/2m0s  1/1 shared iters
wave1_male4     [   0% ] 1 VUs  0m23.4s/2m0s  0/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m23.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m23.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m22.8s/2m0s  0/1 shared iters
wave2_female3 ✓ [ 100% ] 1 VUs  0m18.3s/2m0s  1/1 shared iters
wave2_female4 ✓ [ 100% ] 1 VUs  0m16.9s/2m0s  1/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m22.2s/2m0s  0/1 shared iters
time="2025-12-08T23:43:05Z" level=info msg="[2-f1] State change: waiting → paired (4s)" source=console
time="2025-12-08T23:43:05Z" level=info msg="[2-f1] ✅ MATCH FOUND after 4s (18135ms)" source=console
time="2025-12-08T23:43:05Z" level=info msg="[2-f1] Match ID: 30da80ea-560d-4fc8-893c-2c298ab45533" source=console
time="2025-12-08T23:43:05Z" level=info msg="[2-f1] Partner: Test User 0404dd04" source=console
time="2025-12-08T23:43:05Z" level=info msg="[2-f1] State: paired" source=console
time="2025-12-08T23:43:05Z" level=info msg="[2-f1] Heartbeats sent: 2" source=console
time="2025-12-08T23:43:05Z" level=info msg="[2-f1] ✅ Vote window initialized (expires: 2025-12-08T23:43:11.606695+00:00)" source=console
time="2025-12-08T23:43:05Z" level=info msg="[2-f1] Test completed. Match found: true, Heartbeats: 2" source=console
time="2025-12-08T23:43:05Z" level=info msg="[2-f1] State changes: [{\"time\":1,\"timeMs\":13077,\"from\":null,\"to\":\"waiting\"},{\"time\":4,\"timeMs\":18135,\"from\":\"waiting\",\"to\":\"paired\"}]" source=console

running (0m25.0s), 05/10 VUs, 5 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m25.0s/2m0s  0/1 shared iters
wave1_male2   ✓ [ 100% ] 1 VUs  0m18.0s/2m0s  1/1 shared iters
wave1_male3   ✓ [ 100% ] 1 VUs  0m20.5s/2m0s  1/1 shared iters
wave1_male4   ✓ [ 100% ] 1 VUs  0m24.2s/2m0s  1/1 shared iters
wave1_male5     [   0% ] 1 VUs  0m24.2s/2m0s  0/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m24.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m23.8s/2m0s  0/1 shared iters
wave2_female3 ✓ [ 100% ] 1 VUs  0m18.3s/2m0s  1/1 shared iters
wave2_female4 ✓ [ 100% ] 1 VUs  0m16.9s/2m0s  1/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m23.2s/2m0s  0/1 shared iters
time="2025-12-08T23:43:06Z" level=info msg="[1-m4] State change: waiting → paired (5s)" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m4] ✅ MATCH FOUND after 5s (19341ms)" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m4] Match ID: 30da80ea-560d-4fc8-893c-2c298ab45533" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m4] Partner: Test User b9c0e4cc" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m4] State: paired" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m4] Heartbeats sent: 2" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m4] ✅ Vote window initialized (expires: 2025-12-08T23:43:11.606695+00:00)" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m4] Test completed. Match found: true, Heartbeats: 2" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m4] State changes: [{\"time\":1,\"timeMs\":13277,\"from\":null,\"to\":\"waiting\"},{\"time\":5,\"timeMs\":19341,\"from\":\"waiting\",\"to\":\"paired\"}]" source=console

running (0m26.0s), 04/10 VUs, 6 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m26.0s/2m0s  0/1 shared iters
wave1_male2   ✓ [ 100% ] 1 VUs  0m18.0s/2m0s  1/1 shared iters
wave1_male3   ✓ [ 100% ] 1 VUs  0m20.5s/2m0s  1/1 shared iters
wave1_male4   ✓ [ 100% ] 1 VUs  0m24.2s/2m0s  1/1 shared iters
wave1_male5   ✓ [ 100% ] 1 VUs  0m25.1s/2m0s  1/1 shared iters
wave2_female1   [   0% ] 1 VUs  0m25.0s/2m0s  0/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m24.8s/2m0s  0/1 shared iters
wave2_female3 ✓ [ 100% ] 1 VUs  0m18.3s/2m0s  1/1 shared iters
wave2_female4 ✓ [ 100% ] 1 VUs  0m16.9s/2m0s  1/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m24.2s/2m0s  0/1 shared iters
time="2025-12-08T23:43:06Z" level=info msg="[1-m5] State change: waiting → paired (6s)" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m5] ✅ MATCH FOUND after 6s (19807ms)" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m5] Match ID: ae7ab6f0-714b-44d0-aa7c-62366549f560" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m5] Partner: Test User 0b3c5725" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m5] State: paired" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m5] Heartbeats sent: 2" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m5] ✅ Vote window initialized (expires: 2025-12-08T23:43:15.761415+00:00)" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m5] Test completed. Match found: true, Heartbeats: 2" source=console
time="2025-12-08T23:43:06Z" level=info msg="[1-m5] State changes: [{\"time\":1,\"timeMs\":14026,\"from\":null,\"to\":\"waiting\"},{\"time\":6,\"timeMs\":19807,\"from\":\"waiting\",\"to\":\"paired\"}]" source=console

running (0m27.0s), 03/10 VUs, 7 complete and 0 interrupted iterations
wave1_male1     [   0% ] 1 VUs  0m27.0s/2m0s  0/1 shared iters
wave1_male2   ✓ [ 100% ] 1 VUs  0m18.0s/2m0s  1/1 shared iters
wave1_male3   ✓ [ 100% ] 1 VUs  0m20.5s/2m0s  1/1 shared iters
wave1_male4   ✓ [ 100% ] 1 VUs  0m24.2s/2m0s  1/1 shared iters
wave1_male5   ✓ [ 100% ] 1 VUs  0m25.1s/2m0s  1/1 shared iters
wave2_female1 ✓ [ 100% ] 1 VUs  0m25.4s/2m0s  1/1 shared iters
wave2_female2   [   0% ] 1 VUs  0m25.8s/2m0s  0/1 shared iters
wave2_female3 ✓ [ 100% ] 1 VUs  0m18.3s/2m0s  1/1 shared iters
wave2_female4 ✓ [ 100% ] 1 VUs  0m16.9s/2m0s  1/1 shared iters
wave2_female5   [   0% ] 1 VUs  0m25.2s/2m0s  0/1 shared iters
time="2025-12-08T23:43:07Z" level=info msg="[2-f4] State change: waiting → paired (6s)" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f4] ✅ MATCH FOUND after 6s (20388ms)" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f4] Match ID: ae7ab6f0-714b-44d0-aa7c-62366549f560" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f4] Partner: Test User 89d38952" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f4] State: paired" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f4] Heartbeats sent: 2" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f4] ✅ Vote window initialized (expires: 2025-12-08T23:43:15.761415+00:00)" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f4] Test completed. Match found: true, Heartbeats: 2" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f4] State changes: [{\"time\":1,\"timeMs\":14913,\"from\":null,\"to\":\"waiting\"},{\"time\":6,\"timeMs\":20388,\"from\":\"waiting\",\"to\":\"paired\"}]" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f5] State change: waiting → paired (6s)" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f5] ✅ MATCH FOUND after 6s (20303ms)" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f5] Match ID: 558494ef-3ddb-45e3-a3cd-088f6245608d" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f5] Partner: Test User d25a6f6b" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f5] State: paired" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f5] Heartbeats sent: 1" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f5] ✅ Vote window initialized (expires: 2025-12-08T23:43:15.761415+00:00)" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f5] Test completed. Match found: true, Heartbeats: 1" source=console
time="2025-12-08T23:43:07Z" level=info msg="[2-f5] State changes: [{\"time\":1,\"timeMs\":14866,\"from\":null,\"to\":\"waiting\"},{\"time\":6,\"timeMs\":20303,\"from\":\"waiting\",\"to\":\"paired\"}]" source=console
time="2025-12-08T23:43:07Z" level=info msg="[1-m3] State change: waiting → paired (6s)" source=console
time="2025-12-08T23:43:07Z" level=info msg="[1-m3] ✅ MATCH FOUND after 6s (20457ms)" source=console
time="2025-12-08T23:43:07Z" level=info msg="[1-m3] Match ID: 558494ef-3ddb-45e3-a3cd-088f6245608d" source=console
time="2025-12-08T23:43:07Z" level=info msg="[1-m3] Partner: Test User 5ac2dab1" source=console
time="2025-12-08T23:43:07Z" level=info msg="[1-m3] State: paired" source=console
time="2025-12-08T23:43:07Z" level=info msg="[1-m3] Heartbeats sent: 2" source=console
time="2025-12-08T23:43:07Z" level=info msg="[1-m3] ✅ Vote window initialized (expires: 2025-12-08T23:43:15.761415+00:00)" source=console
time="2025-12-08T23:43:07Z" level=info msg="[1-m3] Test completed. Match found: true, Heartbeats: 2" source=console
time="2025-12-08T23:43:07Z" level=info msg="[1-m3] State changes: [{\"time\":1,\"timeMs\":14891,\"from\":null,\"to\":\"waiting\"},{\"time\":6,\"timeMs\":20456,\"from\":\"waiting\",\"to\":\"paired\"}]" source=console


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<10000' p(95)=12.02s

    http_req_failed
    ✓ 'rate<0.1' rate=4.61%

    match_found
    ✓ 'rate>0.7' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 65     2.387487/s
    checks_succeeded...: 95.38% 62 out of 65
    checks_failed......: 4.61%  3 out of 65

    ✓ setup successful
    ✗ heartbeat successful
      ↳  83% — ✓ 15 / ✗ 3
    ✓ status check successful

    CUSTOM
    heartbeat_failures.............: 3       0.110192/s
    match_found....................: 100.00% 10 out of 10
    match_time_ms..................: avg=16944  min=11697  med=18738    max=20457  p(90)=20394.9 p(95)=20425.95

    HTTP
    http_req_duration..............: avg=2.91s  min=9.45ms med=605.03ms max=12.89s p(90)=7.13s   p(95)=12.02s  
      { expected_response:true }...: avg=2.43s  min=9.45ms med=565.24ms max=12.05s p(90)=7.03s   p(95)=7.15s   
    http_req_failed................: 4.61%   3 out of 65
    http_reqs......................: 65      2.387487/s

    EXECUTION
    iteration_duration.............: avg=22.68s min=16.93s med=24.64s   max=27.22s p(90)=26.03s  p(95)=26.63s  
    iterations.....................: 10      0.367306/s
    vus............................: 3       min=3        max=10
    vus_max........................: 10      min=10       max=10

    NETWORK
    data_received..................: 30 kB   1.1 kB/s
    data_sent......................: 10 kB   382 B/s



running (0m27.2s), 00/10 VUs, 10 complete and 0 interrupted iterations
wave1_male1   ✓ [ 100% ] 1 VUs  0m27.2s/2m0s  1/1 shared iters
wave1_male2   ✓ [ 100% ] 1 VUs  0m18.0s/2m0s  1/1 shared iters
wave1_male3   ✓ [ 100% ] 1 VUs  0m20.5s/2m0s  1/1 shared iters
wave1_male4   ✓ [ 100% ] 1 VUs  0m24.2s/2m0s  1/1 shared iters
wave1_male5   ✓ [ 100% ] 1 VUs  0m25.1s/2m0s  1/1 shared iters
wave2_female1 ✓ [ 100% ] 1 VUs  0m25.4s/2m0s  1/1 shared iters
wave2_female2 ✓ [ 100% ] 1 VUs  0m25.9s/2m0s  1/1 shared iters
wave2_female3 ✓ [ 100% ] 1 VUs  0m18.3s/2m0s  1/1 shared iters
wave2_female4 ✓ [ 100% ] 1 VUs  0m16.9s/2m0s  1/1 shared iters
wave2_female5 ✓ [ 100% ] 1 VUs  0m25.3s/2m0s  1/1 shared iters
time="2025-12-08T23:43:07Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"